Revit 2027 API
View3D.ToggleToPerspective Method
 Toggles this view to perspective.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ToggleToPerspective()
Public Sub ToggleToPerspective
public:
void ToggleToPerspective()
member ToggleToPerspective : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This view cannot be toggled.
Remarks
 This view can only be toggled to perspective if no view specific elements are contained.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace